trialWicking/verification/BL_flow_BC/ABC/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;   
}

nonWetting 
{
   transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5;
    rho             [1 -3 0 0 0 0 0] 1; 
}

sigma            [1 0 -2 0 0 0 0]  0.077;

activateCapillarity     0;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel   BrooksAndCorey;
capillarityModel	    BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 3;
    Sbminpc Sbminpc [0 0 0 0 0 0 0] 0;
    Sbmaxpc Sbmaxpc [0 0 0 0 0 0 0] 1;
    pc0 pc0 [1 -1 -2 0 0 0 0] 0;
    alpha	0.5;	
}

// ************************************************************************* //

// change B on: porous faces with K/dx^2 < darcyFaceMaxDa use the Darcy total flux
darcyFaceMaxDa  0.1;
